import * as Yup from 'yup';

export const FormUserSchema = Yup.object().shape({
    name: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ][^0-9./`~@^()_+=?<>]*$/u,
            "Ім'я повинно бути тільки з літер"
        )
        .min(2, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Поле обов'язкове до заповнення"),
    surname: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ][^0-9./`~@^()_+=?<>]*$/u,
            'Прізвище повинно бути тільки з літер'
        )
        .min(2, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Поле обов'язкове до заповнення"),
    // phone: Yup.string()
    //     .matches(
    //         /^\+(?:[0-9] ?){11}[0-9]$/,
    //         'Невірний формат телефону (+380111222233)'
    //     )
    //     .required("Поле обов'язкове до заповнення"),
    email: Yup.string()
        .max(50, 'Довжина повинна бути не більше 50 cимволів')
        .email('Невірний формат email')
        .matches(
            /^[A-Z0-9._%+-]+@(?!mail\.ru)[A-Z0-9.-]+\.[A-Z]{2,4}$/i,
            'Невірний формат email, або "mail.ru" не допускається'
        )
        .required("Поле обов'язкове до заповнення"),
});
