export const AboutCatData = {
    title: 'Кіт',
    description: [
        'Рудий кіт - найвірніший компаньйон, частина родини, який завжди супроводжує фермера Сергія по всіх кутках його господарства, беручи участь у кожній сільськогосподарській справі. Із своєю природною веселістю та бадьорістю (які завжди виглядають так, ніби кіт готовий вбивати)   він став символом домашнього затишку у житті Сергія та головним персонажем нашої сільської історії.',
    ],
    imageSrc: '/assets/images/about_cat.webp',
    imageWidth: 452,
    imageHeight: 370,
    alt: 'Фото Кота',
    anchor: 'cat',
};
