export const AboutFarmerData = {
    title: 'Фермер',
    description: [
        'Сергій - фермер за покликанням, несподівано для себе відкрив жагу до вирощування справжнього смаку дитинства - овочів із власної землі на Полтавщині. Той смак, який не купиш в магазині чи на ринку. Той смак, який відправляє тебе в найбезтурботніші часи, де ти босоніж бігаєш, зриваєш з грядки теплий під сонцем помідор і кайфуєш від аромату.',
        'Саме цим смаком Сергій ділиться з усіма.',
    ],
    imageSrc: '/assets/images/about_farmer.webp',
    imageWidth: 441,
    imageHeight: 434,
    alt: 'Фото Сергія',
    anchor: 'farmer',
};
