export const faqData = [
    {
        key: 1,
        upperText: 'Чи є можливість для оптових закупівель?',
        lowerText: 'Так. Будь ласка, напишіть нам на пошту serhii.red.marchenko@gmail.com',
    },
    {
        key: 2,
        upperText: 'Які продукти доступні взимку? Тому що вітаміни потрібні цілий рік',
        lowerText: 'На жаль, поки що свіжих продуктів взимку не вирощуємо',
    },
    {
        key: 4,
        upperText:
            'Чи маєте ви сертифікації якості або інші визнані стандарти в галузі сільського господарства?',
        lowerText:
            'У нас не великий бізнес, а звичайний домашній город. Тому сертифікатів немає, а відгуки задоволених друзів є 🙂',
    },
    {
        key: 5,
        upperText: 'Я оплатив замовлення, але воно досі не доставлене. Що я маю робити?',
        lowerText:
            'Будь ласка, перевірте дату доставки, яка вказана для вашого замовлення. Якщо пройшло більше двох днів з кінцевої дати доставки, а повідомлення від Нової пошти немає, напишіть нам і ми знайдемо вашу посилку',
    },
];
