import cls from './PublicOfferAgreement.module.scss';
import { Title } from '@/components';
import { SmachnoLink, SmachnoLinkEmail } from '../SmachnoLink/SmachnoLink';

export const PublicOfferAgreement = () => {
    return (
        <section className={cls.section}>

            <Title
                customClass={cls.title}
                text='Договір публічної оферти'
            />

            <p className={cls.text}>
                За цим Договором одна сторона ФОП Марченко Сергій Едуардович, Податковий номер 2703415510,
                (далі Продавець), з одного боку, і будь-яка особа, яка прийняла умови даного
                Договору публічної оферти - Покупець, з іншого боку, далі разом - Сторони, уклали даний
                Договір публічної оферти (далі — Договір), адресований необмеженому колу осіб,
                який є офіційною публічною пропозицією Продавця укласти з Покупцями договір
                купівлі-продажу Товарів, зображення яких розміщені у відповідному розділі Веб-сайту {<SmachnoLink />}
            </p>

            <p className={cls.text}>
                Покупці при придбанні Товарів, зображення яких розміщені на відповідних сторінках Веб-сайту {<SmachnoLink />},
                приймають умови цього Договору про нижченаведене.
            </p>

            <Title
                customClass={cls.title}
                text='1. ЗАГАЛЬНІ ПОЛОЖЕННЯ'
            />

            <p className={cls.text}>
                1.1. Договірні відносини між Продавцем і Покупцем оформляються у вигляді Договору публічної оферти.
                Натискання на сторінці Веб-сайту {<SmachnoLink />} у відповідному розділі кнопки
                “Перейти до оплати”, означає, що Покупець, незалежно від статусу (фізична особа, юридична особа,
                фізична особа-підприємець), згідно чинного міжнародного та українського законодавства, взяв до
                виконання умови Договору публічної оферти, які вказані нижче.
            </p>

            <p className={cls.text}>                
                1.2. Договір публічної оферти є публічним, тобто відповідно до статей 633,
                641 Цивільного кодексу України його умови однакові для всіх Покупців незалежно
                від статусу (фізична особа, юридична особа, фізична особа-підприємець). При повній
                згоді з даним Договором Покупець приймає умови та порядок оформлення замовлення, оплати
                та доставки товару Продавцем, відповідальності за недобросовісне Замовлення і за невиконання умов цього Договору.
            </p>

            <p className={cls.text}>                
                1.3. Даний Договір набуває чинності з моменту натискання на кнопку “Перейти до оплати”,
                яким Покупець надає згоду здійснити покупку наявного у Продавця Товару та діє до моменту
                отримання Покупцем Товару від Продавця і повного розрахунку з ним.
            </p>

            <p className={cls.text}>
                1.4. Для регулювання договірних правовідносин за Договором Сторони обирають та, в разі
                необхідності, застосовують українське законодавство. Якщо міжнародним договором, згода на
                обов&apos;язковість якого надана Верховною Радою України, встановлені інші правила, ніж ті, що встановлені
                українським законодавством, то застосовуються правила міжнародного договору.
            </p>

            <Title
                customClass={cls.title}
                text='2. ТЕРМІНИ І ВИЗНАЧЕННЯ'
            />

            <p className={cls.text}>
                «Договір публічної оферти» - публічний договір, зразок якого розміщений
                на Веб-сайті {<SmachnoLink />}, і застосування якого є обов’язковим для Продавця,
                що містить пропозицію Продавця щодо придбання Товару, зображення якого розміщено на
                Веб-сайті {<SmachnoLink />}, спрямовану невизначеному колу осіб, у тому числі Покупцям.
            </p>

            <p className={cls.text}>                
                «Акцепт» - прийняття Покупцем пропозиції Продавця щодо придбання Товару,
                типове зображення якого розміщено на Веб-сайті {<SmachnoLink />}, шляхом
                додавання його у віртуальний кошик та відправлення Замовлення.
            </p>

            <p className={cls.text}>
                «Товар» - предмет торгівлі (продукти харчування фермерського виробництва, зокрема овочі,
                фрукти, ягоди, розсада та інші предмети торгівлі), щодо придбання якого
                на Веб-сайті {<SmachnoLink />} розміщена пропозиція Продавця.
            </p>

            <p className={cls.text}>
                «Покупець» - будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець,
                згідно чинного українського законодавства, що відвідали Веб-сайт {<SmachnoLink />} та
                мають намір придбати той чи інший Товар.
            </p>

            <p className={cls.text}>
                «Продавець» - ФОП Марченко Сергій Едуардович, що діє як фізична особа - підприємець
                на підставі виписки з ЄДР (Дата запису: 01.12.2022, номер: 2010350000000236186) і
                продає Товар за допомогою Веб-сайту {<SmachnoLink />}.
            </p>

            <p className={cls.text}>
                «Замовлення» -належно оформлена та розміщена на Веб-сайті {<SmachnoLink />}
                заявка Покупця на купівлю Товарів, що адресується Продавцю.
            </p>

            <p className={cls.text}>
                «Законодавство» -  встановлені українським або міжнародним
                законодавством норми для регулювання договірних правовідносин за Договором.
            </p>

            <p className={cls.text}>
                «Істотний недолік Товару» – недолік, який робить неможливим чи недопустимим використання
                Товару відповідно до його цільового призначення, виник з вини виробника (Продавця), після
                його усунення проявляється знову з незалежних від споживача причин.
            </p>

            <Title
                customClass={cls.title}
                text='3. ПРЕДМЕТ ДОГОВОРУ'
            />

            <p className={cls.text}>
                3.1. Продавець зобов’язується на умовах та в порядку, визначених цим Договором, продати
                Товар на основі Замовлення, оформленого Покупцем на відповідній сторінці Веб-сайту {<SmachnoLink />}, а Покупець
                зобов’язується на умовах та в порядку, визначених цим Договором, придбати Товар і сплатити за нього кошти.
            </p>

            <p className={cls.text}>
                3.2. Продавець гарантує, що Товар не переданий в заставу, не є предметом спору, не перебуває під арештом, а також на нього відсутні будь-які права третіх осіб.
            </p>

            <p className={cls.text}>
                3.3. Продавець та Покупець підтверджують, що чинний Договір не є фіктивною чи удаваною угодою або угодою, укладеною під впливом тиску чи обману.
            </p>

            <p className={cls.text}>
                3.4. Продавець підтверджує, що має всі необхідні дозволи на здійснення господарської діяльності, які регулюють сферу правовідносин, що виникають та діють в процесі виконання цього Договору, а також гарантує, що має право на виробництво та/або реалізацію товару без будь-яких обмежень, у відповідності з вимогами діючого законодавства України, та зобов’язується нести відповідальність у випадку порушення прав Покупця в процесі виконання цього Договору та реалізації Товару.
            </p>

            <Title
                customClass={cls.title}
                text='4. ПРАВА ТА ОБОВЯЗКИ ПРОДАВЦЯ'
            />

            <p className={cls.text}>
                4.1. Продавець зобов’язаний:
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> виконувати умови даного Договору;
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> виконувати замовлення Покупця в разі надходження оплати від Покупця;
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> передати Покупцю Товар згідно з вибраним зразком на відповідній
                сторінці Веб-сайту {<SmachnoLink />} , оформленим Замовленням і умовами даного Договору;
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span>  перевірити якісні і кількісні характеристики Товару під час його пакування;
            </p>

            <p className={cls.text}>
                4.2. Продавець має право:
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> в односторонньому порядку призупинити надання
                послуг за цим Договором у випадку порушення Покупцем умов цього Договору.
            </p>

            <Title
                customClass={cls.title}
                text='5. ПРАВА ТА ОБОВЯЗКИ ПОКУПЦЯ'
            />

            <p className={cls.text}>
                5.1. Покупець зобов’язаний:
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> своєчасно оплатити і отримати замовлення на умовах цього Договору;
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> ознайомитись з інформацією про Товар, яка розміщена на Веб-сайті {<SmachnoLink />};
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span>  при отриманні Товару у особи, що здійснила його доставку, впевнитися у цілісності та комплектності Товару шляхом огляду вмісту упаковки. У випадку виявлення пошкоджень чи неповної комплектації Товару – зафіксувати їх в акті, який разом із Покупцем повинна підписати особа, яка здійснила його доставку Покупцеві.
            </p>

            <p className={cls.text}>
                5.2. Покупець має право:
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> оформити замовлення на відповідній сторінці Веб-сайту {<SmachnoLink />};
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span>  вимагати від Продавця виконання умов цього Договору.
            </p>
            
            <Title
                customClass={cls.title}
                text='6. ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ'
            />

            <p className={cls.text}>
                6.1. Покупець самостійно оформлює Замовлення на відповідній сторінці Веб-сайту {<SmachnoLink />}  шляхом додавання Товарів у віртуальний кошик за допомогою натискання кнопки “Замовити”.
            </p>

            <p className={cls.text}>
                6.2. Строк формування Замовлення до 7 робочих днів з моменту його оформлення. В разі, якщо Замовлення оформлено на сайті у вихідний або святковий день, строк формування починається з першого робочого дня після вихідного.В окремих випадках строк формування Замовлення може бути більшим. В такому разі Продавець зобов’язується завчасно інформувати Покупців.
            </p>

            <p className={cls.text}>
                6.3. Строк доставки Товару на виріст формується індивідуально і відповідає графіку природнього дозрівання продукту + 7 робочих днів на формування замовлення + термін доставки перевізником.
            </p>

            <Title
                customClass={cls.title}
                text='7. ЦІНА ДОГОВОРУ І ПОРЯДОК ОПЛАТИ'
            />

            <p className={cls.text}>                
                7.1. Ціна кожного окремого Товару визначається Продавцем та зазначається на відповідній
                сторінці Веб-сайту {<SmachnoLink />} . Ціна Договору визначається шляхом додавання цін
                всіх обраних Товарів поміщених у віртуальний кошик та ціни доставки, яка визначається в
                залежності від способу доставки відповідно до умов розділу 8 цього Договору.
            </p>

            <p className={cls.text}>
                7.2. Вартість Замовлення може змінюватись в залежності від ціни, кількості чи номенклатури товару.
            </p>

            <p className={cls.text}>
                7.3. Покупець може оплатити Замовлення наступними способами:
            </p>

            <p className={cls.text}>
                1) за допомогою банківського переказу грошей на поточний рахунок Продавця, що вказаний
                в рахунку, в т.ч. за допомогою Інтернет-банкінгу (Покупець оплачує Замовлення одразу
                при оформленні замовлення через сайт {<SmachnoLink />}  в розмірі 100% передплати
                за допомогою платіжної системи MonoPay).
            </p>

            <p className={cls.text}>
                2) банківською карткою наступного типу:
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> Visa
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> Visa Electron
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> Mastercard
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> Mastercard Electronic
            </p>

            <p className={cls.text}>
                <span className={cls.mark}>o</span> Maestro
            </p>

            <p className={cls.text}>
                3)  будь-яким іншим способом за домовленістю з Продавцем.
            </p>

            <p className={cls.text}>
                Примітка. При оплаті Покупцем замовлення платіжною карткою можливо стягування додаткової комісії
                емітентом цієї картки, зокрема при оплаті Покупцем замовлення платіжною карткою можливо стягування
                додаткової комісії при оплаті Покупцем європейських замовлень емітентами карток Visa, Mastercard,
                Visa Electron, Mastercard Electronic, Maestro. При натисканні на сторінці Веб-сайту {<SmachnoLink />}  у
                відповідному розділі кнопки «Оформити замовлення» означає, що Продавець повідомив Покупця про можливість
                стягнення додаткової комісії при оплаті Покупцем європейських замовлень, емітентом картки Visa, Mastercard,
                Visa Electron, Mastercard Electronic, Maestro.
            </p>

            <Title
                customClass={cls.title}
                text='8. УМОВИ ДОСТАВКИ ТОВАРУ'
            />

            <p className={cls.text}>
                8.1 Покупець отримує Товар за допомогою поштової служби доставки, або отримує його особисто.
            </p>

            <p className={cls.text}>
                8.2. При доставці Товарів в інші міста України, що виконується Службами доставки (далі Компаніями-перевізниками) Покупець у
                повному обсязі і беззастережно погоджується з Правилами перевезення вантажів цими Компаніями-перевізниками.
            </p>

            <p className={cls.text}>
                8.3. Факт отримання Товару та відсутність претензій до якості Товару, який доставляється
                Компаніями-перевізниками, Покупець підтверджує власним підписом у товаро-транспортній накладній,
                декларації Компанії-перевізника, або у видатковій накладній при отриманні Товару. Зі свого боку,
                Продавець гарантує відвантаження Товару Компанії-перевізнику у кількості, зазначеній і оплаченій Покупцем,
                в комплектності згідно специфікації цього Товару і в належному стані та якості.
            </p>

            <p className={cls.text}>
                8.4. У разі відсутності Покупця за адресою доставки, вказаної Покупцем в заявці або
                відмови Покупця від отримання Товару з необґрунтованих причини, при доставці кур´єром Компанії-перевізника,
                Товар повертається Продавцеві. Оплата за послуги Компанії-перевізника вираховується із суми, перерахованої
                Покупцем за Товар. Залишок суми повертається Покупцеві на підставі його листа,
                відправленого на e-mail: {<SmachnoLinkEmail />} та за згодою обох сторін.
            </p>

            <p className={cls.text}>
                Усі питання на суперечки між сторонами вирішуються в двосторонньому діалозі та за згодою обох сторін.
            </p>

            <Title
                customClass={cls.title}
                text='9. УМОВИ ПОВЕРНЕННЯ ТОВАРУ'
            />

            <p className={cls.text}>
                9.1. Відповідно до ст. 13, 14, 20 Закону України «Про захист прав споживачів», всі
                харчові продукти належної якості не підлягають поверненню.
            </p>

            <p className={cls.text}>
                9.2. Якщо товар не відноситься до харчових продуктів відповідно до ст. 9 Закону України «Про захист прав споживачів»,
                Покупець має право на обмін Товару належної якості протягом чотирнадцяти днів, не рахуючи дня купівлі, якщо
                триваліший строк не оголошений Продавцем. Покупець має право на обмін Товару із врахуванням положень
                законодавства про підстави та перелік Товарів, що не підлягають обміну (поверненню).
            </p>

            <p className={cls.text}>
                9.3. Якщо Покупець має намір повернути Товар, таке повернення здійснюється відповідно до розділу
                Сайту «Повернення» з урахуванням правил та умов перевізника або кур’єра, які діють на території України
                чи на території іншої країни відповідно до місця здійснення отримання Товару.
            </p>

            <p className={cls.text}>
                9.4. У випадку наявності хоча б одного з перерахованих недоліків, Покупець зобов’язаний
                зафіксувати його у складеному акті довільної форми. Акт повинен бути підписаний Покупцем та особою, що
                здійснила доставку Товару або Продавця. При можливості недоліки повинні бути зафіксовані засобами фото- або відеозйомки.
                Протягом 1 (одного) дня Покупець зобов’язаний повідомити представника Продавця відповідального за оформлення
                замовлення на Товар про виявлені недоліки та повідомити на електронну адресу {<SmachnoLinkEmail />}
            </p>

            <p className={cls.text}>
                9.5. Сторони погодили, що у випадку недотримання обов’язкових вимог вказаної процедури, визнається
                отримання Покупцем Товару у належному стані – без будь-яких механічних пошкоджень товару або його
                упаковки та у повній комплектності.
            </p>

            <Title
                customClass={cls.title}
                text='10. ВІДПОВІДАЛЬНІСТЬ СТОРІН'
            />

            <p className={cls.text}>
                10.1. Сторони відповідають за невиконання або неналежне виконання умов цього Договору в порядку, передбаченому цим Договором і чинним законодавством України.
            </p>

            <p className={cls.text}>
                10.2. У разі виникнення спорів, пов&apos;язаних з виконанням Сторонами цього Договору Сторони зобов&apos;язуються вирішувати їх шляхом переговорів з дотриманням претензійного порядку. Термін розгляду претензії — 7 (сім) календарних днів від дати її отримання.
            </p>

            <p className={cls.text}>
                10.3. Усі спори, розбіжності або вимоги, що виникають з цього Договору або у зв&apos;язку з ним, у тому числі що стосуються його виконання, порушення, припинення або недійсності, підлягають вирішенню у відповідному суді згідно українського законодавства.
            </p>

            <Title
                customClass={cls.title}
                text='11. ФОРС-МАЖОРНІ ОБСТАВИНИ'
            />

            <p className={cls.text}>
                11.1. Сторони не несуть відповідальності за невиконання будь-якого зі своїх зобов&apos;язань, за винятком зобов&apos;язань по оплаті, якщо доведуть, що таке невиконання було викликано форс-мажорними обставинами, тобто подіями або обставинами, дійсно знаходяться поза контролем такої Сторони, настали після укладення цього Договору, що носять непередбачений і невідворотний характер.
            </p>

            <p className={cls.text}>
                До форс-мажорних обставин належать, зокрема, природні катаклізми, страйки, пожежі, повені, вибухи, обмерзання, війни (як оголошені, так і неоголошені), заколоти, загибель представника Сторони, затримки перевізників, викликані аваріями або несприятливими погодними умовами, обмеження, що накладаються державними органами (включаючи розподілу, пріоритети, офіційні вимоги, квоти і ціновий контроль), якщо ці обставини безпосередньо вплинули на виконання цього Договору.
            </p>

            <p className={cls.text}>
                11.2. Сторона, для якої стало неможливим виконання зобов&apos;язань за цим Договором через настання форс-мажорних обставин, повинна негайно інформувати іншу Сторону в письмовому вигляді про виникнення вищевказаних обставин, а також протягом 30 (тридцяти) календарних днів надати іншій Стороні підтвердження форс-мажорних обставин.
            </p>

            <p className={cls.text}>
                11.3. Час, який потрібен Сторонам для виконання своїх зобов&apos;язань за цим Договором, буде продовжено на будь-який термін, протягом якого було відкладено виконання через перерахованих обставин.
            </p>

            <p className={cls.text}>
                11.4. Якщо через дію обставин непереборної сили невиконання зобов’язань за цим Договором триває більше трьох місяців, кожна із Сторін має право розірвати цей Договір в односторонньому порядку, письмово повідомивши про це іншу сторону. Незважаючи на настання форс-мажору, перед припиненням цього Договору внаслідок форс-мажорних обставин Сторони здійснюють остаточні взаєморозрахунки.
            </p>

            <p className={cls.text}>
                Незважаючи на настання форс-мажору, перед припиненням цього Договору внаслідок форс-мажорних обставин Сторони здійснюють остаточні взаєморозрахунки.
            </p>

            <Title
                customClass={cls.title}
                text='12. ІНШІ УМОВИ ДОГОВОРУ'
            />

            <p className={cls.text}>
                12.1. Інформація, що надається Покупцем є конфіденційною. Інформація про Покупця використовується виключно в цілях виконання його Замовлення (відправлення повідомлення Продавцю про замовлення Товару, надсилання повідомлень і т.д.).
            </p>

            <p className={cls.text}>
                12.2. Власним акцептування Договору або реєстрацією на сайті {<SmachnoLink />}  (заповнення реєстраційної анкети) Покупець добровільно надає згоду на збір та обробку власних персональних даних з наступною метою: дані, що стають відомі використовуватимуться в комерційних цілях, в тому числі для обробки замовлень на придбання товарів, отримання інформації про замовлення, надсилання телекомунікаційними засобами зв’язку (електронною поштою, мобільним зв’язком) рекламних та спеціальних пропозицій, інформації про акції, розіграші або будь-якої іншої інформації про діяльність сайту {<SmachnoLink />}
            </p>

            <p className={cls.text}>
                Для цілей, передбачених цим пунктом, Покупцю мають право направлятися листи, повідомлення та матеріали на поштову адресу, e-mail Покупця, а також відправлятися sms-повідомлення, sms-повідомлення у viber, здійснюватися дзвінки на вказаний в анкеті телефонний номер.
            </p>

            <p className={cls.text}>
                12.3. Покупець дає право здійснювати обробку його персональних даних, у тому числі: поміщати персональні дані в бази даних (без додаткового повідомлення про це), здійснювати довічне зберігання даних, їх накопичення, оновлення, зміну (у міру необхідності). Продавець бере на себе зобов&apos;язання забезпечити захист даних від несанкціонованого доступу третіх осіб, не поширювати і не передавати дані будь-якій третій стороні (крім передачі даних пов&apos;язаним особам, комерційним партнерам, особам, уповноваженим Продавцем на здійснення безпосередньої обробки даних для зазначених цілей, а також на обов&apos;язковий запит компетентного державного органу).
            </p>

            <p className={cls.text}>
                12.4. У випадку небажання отримувати розсилку, Покупець має право звернутися до Продавця, написавши заяву про відмову від отримання рекламних матеріалів, надіславши його на поштову або електронну адресу.
            </p>

            <p className={cls.text}>
                12.5. Продавець не несе відповідальність за зміст і правдивість інформації, що надається Покупцем при оформленні замовлення. Покупець несе відповідальність за достовірність вказаної при оформленні замовлення інформації.
            </p>

            <p className={cls.text}>
                12.6.  Покупець має право звернутися до Продавця щодо видалення персональних даних про себе. Для цього необхідно звернутися до Продавця за електронною адресою {<SmachnoLinkEmail/>}
            </p>

            <Title
                customClass={cls.title}
                text='ПРОДАВЕЦЬ'
            />

            <p className={cls.text}>
                ІПН 2703415510
            </p>
            <p className={cls.text}>
                ПІБ МАРЧЕНКО СЕРГІЙ ЕДУАРДОВИЧ 
            </p>
            <p className={cls.text}>
                Зареєстрований ГУ ДПС У ПОЛТАВСЬКІЙ ОБЛАСТІ (ЧОРНУХИНСЬКИЙ Р-Н) 
            </p>
            <p className={cls.text}>
                Дата взяття на облік платника податків 02.12.2022
            </p>
            <p className={cls.text}>
                Номер взяття на облік платника податків 162822221054
            </p>
            <p className={cls.text}>
                Адреса УКРАЇНА, 37127, ПОЛТАВСЬКА ОБЛАСТЬ, ЛУБЕНСЬКИЙ РАЙОН, СЕЛО ПІСКИ - УДАЙСЬКІ ВУЛ. ЧУТОВКА, БУД. 41
            </p>
            <p className={cls.text}>
                Вирощування овочiв i баштанних культур, коренеплодiв i бульбоплодiв
            </p>

        </section>
    )
};
