import * as Yup from 'yup';

export const FormAddressSchema = Yup.object().shape({
    recieverName: Yup.string()
        .min(3, 'Довжина повинна бути більше 3 символів')
        .max(50, 'Довжина повинна бути не більше 50 cимволів')
        .trim(),
    name: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ-][^./`~@^()_+=?<>]*$/u,
            "Ім'я повинно бути тільки з літер"
        )
        .min(2, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Поле обов'язкове до заповнення"),
    surname: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ-][^./`~@^()_+=?<>]*$/u,
            'Прізвище повинно бути тільки з літер'
        )
        .min(2, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Поле обов'язкове до заповнення"),
    // phone: Yup.string()
    //     .matches(
    //         /^\+(?:[0-9] ?){11}[0-9]$/,
    //         'Невірний формат номера телефону (+380111222233)'
    //     )
    //     .required("Поле обов'язкове до заповнення"),
    // city: Yup.string()
    //     .matches(
    //         /^[A-Za-zА-Яа-яІіЇїЄєҐґ\s():;\-'']+$/,
    //         "Місто повинно бути тільки з літер, пробілів та -"
    //     )
    //     .min(2, 'Довжина повинна бути більше 2 символів')
    //     .max(30, 'Довжина не більше 30 символів')
    //     .trim()
    //     .required("Поле обов'язкове до заповнення"),
    address: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'ʼ-](?:[^./`~@^()_+=?<>]*\.?[^./`~@^()_+=?<>]*)*$/u,
            "Використовуються недозволені символи"
        )
        .min(2, 'Довжина повинна бути більше 2 символів')
        .max(100, 'Довжина повинна бути не більше 100 cимволів')
        .trim(),
    // postOffice: Yup.string()
    //     .min(2, 'Довжина повинна бути більше 2 символів')
    //     .max(100, 'Довжина повинна бути більше 100 cимволів')
    //     .trim(),
    // postBox: Yup.string()
    //     .min(2, 'Довжина повинна бути більше 2 символів')
    //     .max(100, 'Довжина повинна бути більше 100 cимволів')
    //     .trim(),
});
