import * as Yup from 'yup';

export const FormAdminSchema = Yup.object().shape({
    name: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ-][^./`~@^()_+=?<>]*$/u,
            "Ім'я повинно бути тільки з літер"
        )
        .min(3, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Обов'язкове поле"),
    surname: Yup.string()
        .matches(
            /^[A-Za-zА-Яа-яІіЇїЄєҐґ'-ʼ-][^./`~@^()_+=?<>]*$/u,
            'Прізвище повинно бути тільки з літер'
        )
        .min(3, 'Довжина повинна бути більше 2 символів')
        .max(30, 'Довжина не більше 30 символів')
        .trim()
        .required("Обов'язкове поле"),
    email: Yup.string()
        .max(50, 'Довжина повинна бути не більше 50 cимволів')
        .email('Невірний формат email')
        .matches(
            /^[A-Z0-9._%+-]+@(?!mail\.ru)[A-Z0-9.-]+\.[A-Z]{2,4}$/i,
            'Невірний формат email, або "mail.ru" не допускається'
        )
        .required("Обов'язкове поле"),
});
